[
  {
    "page_content": "HCM Portal User Guide\n\n1. Introduction\n\nThis document serves as a user guide for the HCM Portal. It is intended to help users understand the application, navigate through different screens, and perform various tasks efficiently."
  },
  {
    "page_content": "2. Purpose\n\nPurpose of this document is to identify relevant information based on the user question and help user. And the role based details should be strictly restricted to the role of the current user who logged into the system. That means, if an Admin is asking the question, he should get details related only to Admin screens, functionalities and capabilities, and similarly when a manager is asking questions, he should get information about the screens specific to manager role."
  },
  {
    "page_content": "2. Getting Started\n\nTo begin using the HCM Portal, users must log in with their credentials. The portal is divided into different sections based on user roles such as Manager and Admin. Each screen is equipped with an AI Web Assistant to provide contextual help.\n\n3. Manager Screens"
  },
  {
    "page_content": "3.1 Dashboard\n\nThe Dashboard provides an overview of\n\nNumber of employees under current manager.\n\nPending number of leave requests to be approved.\n\nQuick Action section with below options\n\nAdd New Employee\n\nReview Leave Requests\n\nNavigation Paths:\n\nAccessible directly after login.\n\n'Add New Employee' can also be accessed from the left navigation or Employee Management screen."
  },
  {
    "page_content": "3.2 Employee Management\n\nTo go to employee management page use URL Path: http://localhost:4200/employees\n\nThis screen allows managers to view and manage employee records.\n\nUsing Add Employee on the top right, user can go to add employee screen and add new employee record.\n\nThen, there is a row of filters to filter the employees on different filters like,\n\nEmployee name\n\nDepartment\n\nEngineering\n\nMarketing\n\nSales\n\nHR\n\nFinance\n\nOperations\n\nEmployee Status\n\nActive\n\nInactive\n\nOn Leave\n\nTerminated"
  },
  {
    "page_content": "Date filter to filter by From and To of joining date.\n\nThen the grid follows with below list of details shown for every employee,\n\nEmployee ID\n\nFull Name\n\nDepartment\n\nDesignation\n\nEmployment Type\n\nStatus\n\nDate of Joining\n\nThen there are action buttons against each employee record to view employee information and edit employee information\n\nView Employee show all below data about employee on the popup:\n\nBasic Information\n\nEmployee ID\n\nFull Name\n\nDepartment\n\nDesignation\n\nEmployment Type\n\nStatus"
  },
  {
    "page_content": "Role\n\nDate of Joining\n\nManager\n\nContact Information\n\nEmail\n\nPhone\n\nAddress"
  },
  {
    "page_content": "3.3 Add New Employee\n\nTo go to add employee page use URL Path: http://localhost:4200/employees/add\n\nOn this screen, manager can onboard/add new employee to the system/company.\n\nBelow list of details can be captured on this screen.\n\nBasic Information\n\nEmployee ID (Required field)\n\nFull Name (Required field)\n\nDate of Joining (Required field)\n\nDepartment (Required field)\n\nDesignation (Required field)\n\nEmployment Type (Required field)\n\nManager Name (Required field)\n\nContact Information\n\nEmail\n\nPhone"
  },
  {
    "page_content": "Role\n\nAddress\n\nOnce the data is entered, user can click on Save Employee to save the details.\n\nNavigation Paths:\n\nVia Dashboard Quick Actions\n\nFrom left navigation menu item “Manage Employees”"
  },
  {
    "page_content": "3.4 Leave Request Management\n\nTo go to leave request management page use URL Path: http://localhost:4200/leave-requests\n\nManager can view and manage leave requests submitted by his reporting employees.\n\nOn the top right, list of filters to filter leave requests by different statuses All, Pending, Approved and Rejected are available, user can also see the number of requests in that status next to each filter name.\n\nThen a full-fledged row of filters are there to filter/search leave requests by"
  },
  {
    "page_content": "Employee name\n\nDepartment\n\nEngineering\n\nMarketing\n\nSales\n\nHR\n\nFinance\n\nOperations\n\nLeave Type\n\nAnnual\n\nSick\n\nPersonal\n\nMaternity\n\nPaternity\n\nDate range filter with From and TO dates to filter by leave requested date\n\nThen there is an option to Clear Filter, if the expected leave requests are not shown in the grid, user can try to clear filters to see all requests.\n\nThen the grid with leave requests is available with below data being shown for each leave request\n\nEmployee Name\n\nDepartment"
  },
  {
    "page_content": "Leave Type\n\nDuration Reason\n\nRequest Date\n\nStatus\n\nAnd the last column in the grid has three actions\n\nApprove, if manger is good with schedule and dependency and with the leave reason, he can approve it using this option.\n\nReject, if there is any specific dependency with employee or for other reasons, manager can use this option to reject leave request."
  },
  {
    "page_content": "Request Change, this allows manager to request employee for changing the leave plan. When this button is clicked, a popup asking for Change Request Comment is shown where manager can add details and request changes.\n\nNavigation Paths:\n\nFrom Manager Dashboard\n\nVia left navigation menu\n\n4. Admin Screens\n\nAdmins can initiate and manage exit processes.\n\nAdmin’s left navigation has Admin Functions section where he can navigate to Employee Exit and Dashboard screens."
  },
  {
    "page_content": "4.1 Dashboard\n\nOn Admin dashboard, user can see two different sections,\n\nExit Processes the number here shows the number in progress exit requests.\n\nTotal Employees this number shown the companywide number of employees.\n\nThen, there is Quick Actions section where “Initiate Exit Process” button is available, by clicking it, admin can land on employee exit management screen."
  },
  {
    "page_content": "4.2 Employee Exit Management\n\nThis screen is used to manage employee exit processes. As an Admin, he can initiate exit process for an employee and he can mark them as done once the process is complete."
  },
  {
    "page_content": "While initiating exit process, once employee is selected, Exit Type can be selected from the list “Resignation”, “Termination” or “Retirement”, then select last working day, add offboarding notes to future reference, then mark all applicable offloading tasks as done by checking checkbox, below are list of tasks\n\nCollect company laptop and equipment\n\nDeactivate system access and accounts\n\nCollect ID badge and access cards\n\nConduct exit interview\n\nProcess final payroll and benefits"
  },
  {
    "page_content": "Return company documents and files\n\nComplete knowledge transfer\n\nUpdate organizational chart\n\nNotify clients and stakeholders\n\nFields and Elements:\n\nEmployee ID (Required)\n\nExit Date (Required)\n\nReason for Exit (Optional)\n\nNavigation Paths:\n\nFrom Admin Dashboard, user can use Initiate Exit Process and land on Employee Exit Management screen, then click on Initiate Exit Process"
  },
  {
    "page_content": "Via Employee Management screen, user can directly click on Initiate Exit Process to launch entry form as popup, submit data and click Initiate Exit Process.\n\nOnce the exit process is initiated, Admin can see list of exit requests in the grid and on the grid, for each request, information like employee name, exit type, last working date, initiated date, status, etc., can be seen."
  },
  {
    "page_content": "Then the overall status is also shown on the top of the screen in three different sections where each will show the number of requests in that section.\n\nIn Progress\n\nCompleted\n\nThis Month\n\nThen there is a row of filters where admin can filter requests by employee name, exit type or status."
  },
  {
    "page_content": "5. AI Web Assistant\n\nThe AI Web Assistant is available on every screen to provide contextual help.\n\nUsers can interact with the assistant to:\n\nGet help on how to use the current screen\n\nUnderstand field requirements\n\nTo achieve specific functional flow.\n\nNavigate to other screens"
  }
]